# SQL (NOTE)

# 1 (Hindi)

SQL ek programming language hai jo bahut saari badi companies use karti hain, jaise Instagram, Amazon, Google, Uber, Flipkart aur kai aur.

Database ko access, manage, aur manipulate karne ke liye SQL ka use hota hai. Chahe data ko read karna ho, insert karna ho, update ya deleteâ€”har jagah SQL ka role hota hai.

Agar aap data-related work (Data Analyst, Data Scientist, etc.) karna chahte ho, to SQL ek must-have skill hai.

Software Engineering roles ke liye bhi SQL bahut important hoti hai, kyunki real-world applications hamesha databases ke saath kaam karti hain. Isliye SQL ka knowledge industry me har role ke liye valuable hota hai.

# (English)

SQL is a programming language that is widely used by many companies, such as Instagram, Amazon, Google, Uber, Flipkart, and many others.

SQL is used to access, manage, and manipulate databases. It helps in reading, inserting, updating, and deleting data from databases.

If you want to work in data-related fields like Data Analyst or Data Scientist, SQL is an essential skill.

SQL is also very useful for Software Engineering roles, because real-world applications always work with databases. Therefore, SQL knowledge is important across many technical roles.

# 2

SQL seekhne se pehle, hume database aur data se related kuch fundamental concepts ka basic knowledge hona zaroori hai.

or

Before learning SQL, we should have knowledge of some fundamental concepts related to data and databases.


# (i).Database:-

Definition:- Database is collection of data in a format that can be easily accesses(Digital).


                1.(Hindi)

Database ka matlab hota hai collection of data.

For example, Facebook, Instagram, WhatsApp jaise companies ke paas bahut zyada data hota hai.

Jab hum Instagram par account create karte hain, to Instagram humse kai details maangta hai, jaise username, password, phone number, email, etc.

Ye saari information database me store ho jaati hai, taaki company user data ko securely manage aur access kar sake.

Instagram apna data database me store karta hai. Is tarah se data ka ek proper collection ban jaata hai.

Ye data ek aise format me store hota hai jise hum easily access kar sakte hain (digital format).

             Easily access ka matlab hai:

         i.hum data ko easily search kar sakte hain
         ii.naya data add (insert) kar sakte hain
         iii.existing data update kar sakte hain
         iv.aur data delete bhi kar sakte hain
Aisa organized aur easily accessible data ka collection hi database kehlata hai.
Hamara data digital format me hota hai, yani ye computer systems me electronically store kiya jaata hai.


              2.(English)

A database means a collection of data.

For example, companies like Facebook, Instagram, and WhatsApp have a very large amount of data.

When we create an Instagram account, Instagram asks for many details such as username, password, phone number, email, and more.

All this information is stored in a database, so the company can securely manage and access user data.

Instagram stores its data in a database. In this way, a proper collection of data is created.

The data is stored in a format that can be easily accessed (digital format).

              Easy access means:

          i. we can easily search the data
          ii. add new data
          iii.update existing data
          iv.and delete data whenever required
Such an organized and easily accessible collection of data is called a database.
The data is stored in digital format, which means it is saved electronically in computer systems.


# (ii).DBMS

Defination:- A software application used to manage our DB is called DBMS(Database Managemant System).

           (Hindi)
A software application used to manage our DB is called DBMS(Database Managemant System)

DBMS ek type ka software application hota hai, jiska kaam database ko manage karna hota hai.

            Manage karne ka matlab hota hai:

          i.data add (insert) karna
          ii.data update karna
          iii.data delete karna
          iv.aur data search (retrieve) karna

Ye process is tarah se kaam karta hai ki user kabhi bhi directly database ko access nahi karta.

Database ko directly use karne ke bajay, hum DBMS ka use karte hain, aur DBMS backend me jaakar database ko access karta hai.

Is tarah DBMS ek beech ka layer (middle layer) ban jaata hai, jo ek software application hota hai aur user aur database ke beech communication ka kaam karta hai.

Hum jo SQL use karte hain, wo DBMS ke saath interact karne ke liye use hoti hai, jisse DBMS database par required operations perform karta hai.



                    (english)

Here is a clear, well-written, and professional English version:

A DBMS is a type of software application whose main function is to manage a database.

               Managing a database means:

            i.adding (inserting) data
            ii.updating data
            iii.deleting data
            iv.and searching (retrieving) data

In this process, the user never directly accesses the database.

Instead of using the database directly, we use a DBMS, and the DBMS accesses the database in the backend.

Thus, a DBMS acts as an intermediate layer (middle layer) between the user and the database. It is a software application that handles all communication with the database.

SQL is used to interact with the DBMS, and the DBMS uses SQL commands to perform operations on the database.

# Types of Databases

     Their are two type of Database:
         i.Relational 
         ii.Non-relational(NoSQL)
         
#i.Relation Database:-

          In Hindi

Relational Database ka matlab hota hai ki data ko table format me store kiya jaata hai.

For example, class teacher student information store karne ke liye register banata hai, jisme student name, roll number, present/absent jaise details hoti hain.

Bilkul isi tarah, relational database me bhi data tables ke form me store hota hai, jahan rows aur columns hote hain.

Har table ek specific type ka data store karta hai, aur tables ke beech relationships bhi ho sakti hain.

           Relational databases ke kuch popular examples hain:

            i.MySQL
            ii.Oracle
            iii.SQL Server
            iv.PostgreSQL

            

    #In English

A relational database means that data is stored in table format.

For example, a class teacher maintains a register to store student details such as student name, roll number, and attendance (present or absent).

In the same way, a relational database stores data in the form of tables, where data is organized into rows and columns.

Each table stores a specific type of data, and relationships can exist between different tables.

          Some popular examples of relational databases are:

       i. MySQL
       ii. Oracle
       iii. SQL Server
       iv.PostgreSQL


# Non-relational(NoSQL)

Non-relational databases are types of databases that do not store data in table format.

Instead of rows and columns, they store data in flexible formats such as documents, key-value pairs, or JSON-like structures.

These databases are useful when data is unstructured or semi-structured.

A popular example of a non-relational (NoSQL) database is MongoDB.

          unstructure and semi-structure

#Unstructured Data:

         i.This is data that does not have a predefined format or organization.
         ii.It is difficult to store in tables.
         iii.Examples: Images, videos, audio files, emails, social media posts.

#Semi-Structured Data:

        i.This is data that does not follow a strict table format but still has some structure or tags to organize it.
        ii.Examples: JSON files, XML files, CSV files, log files.

# 3.
# SQL

# what IS SQL?
  :- Structure Query Language 
  
  :- SQL is a programming language used to interact with relational databases.

     it is used to perform CRUD operation:
     i.Create 
     ii.Read
     iii.Update
     iv.Delete

# Database Structure

In [15]:
from IPython.display import HTML

In [16]:
%%html
<!DOCTYPE html>
<html>
<head>
    <title>Table</title>
</head>
<body>

<h1>Student Table</h1>

<table border="1">
    <tr>
        <th>Roll No</th>
        <th>Name</th>
        <th>Class</th>
        <th>DOB</th>
        <th>Gender</th>
        <th>City</th>
        <th>Marks</th>
    </tr>

    <tr>
        <td>1</td>
        <td>Nisha Thakur</td>
        <td>Bachelor</td>
        <td>2005-01-26</td>
        <td>F</td>
        <td>UP</td>
        <td>8.27 CGPA</td>
    </tr>

    <tr>
        <td>2</td>
        <td>Shivam Thakur</td>
        <td>Bachelor</td>
        <td>2005-06-30</td>
        <td>M</td>
        <td>Kathmandu</td>
        <td>9.27 CGPA</td>
    </tr>

    <tr>
        <td>3</td>
        <td>Muskan</td>
        <td>Bachelor</td>
        <td>2006-12-17</td>
        <td>F</td>
        <td>UP</td>
        <td>8.27 CGPA</td>
    </tr>

    <tr>
        <td>4</td>
        <td>Sandhya</td>
        <td>Bachelor</td>
        <td>2005-09-01</td>
        <td>F</td>
        <td>Haryana</td>
        <td>9.12 CGPA</td>
    </tr>

    <tr>
        <td>5</td>
        <td>Aaditya Thakur</td>
        <td>Ten</td>
        <td>2008-08-18</td>
        <td>M</td>
        <td>Janakpur</td>
        <td>82%</td>
    </tr>

    <tr>
        <td>6</td>
        <td>Amisha Thakur</td>
        <td>Bachelor</td>
        <td>2003-03-14</td>
        <td>F</td>
        <td>Janakpur</td>
        <td>8.00 CGPA</td>
    </tr>

    <tr>
        <td>7</td>
        <td>Shisha</td>
        <td>Bachelor</td>
        <td>2004-02-16</td>
        <td>F</td>
        <td>Delhi</td>
        <td>7.21 CGPA</td>
    </tr>

    <tr>
        <td>8</td>
        <td>Aasu</td>
        <td>XII</td>
        <td>2004-04-16</td>
        <td>F</td>
        <td>UP</td>
        <td>8.27 CGPA</td>
    </tr>
</table>

</body>
</html>

 # or

In [21]:
import pandas as pd
from IPython.display import HTML, display

data = {
    "Roll No": [1,2,3,4,5,6,7,8],
    "Name": ["Nisha Thakur","Shivam Thalur","Muskan","Sandhya",
             "Aaditya Thakur","Amisha Thakur","Shisha","Aasu"],
    "Class": ["Bachelor","Bachelor","Bachelor","Bachelor",
              "Ten","Bachelor","Bachelor","XII"],
    "DOB": ["2005-01-26","2005-06-30","2006-12-17","2005-09-01",
            "2008-08-18","2003-03-14","2004-02-16","2004-04-16"],
    "Gender": ["F","M","F","F","M","F","F","F"],
    "City": ["UP","Kathmandu","UP","Haryana",
             "Janakpur","Janakpur","Delhi","UP"],
    "Marks": ["8.27 CGPA","9.27 CGPA","8.27 CGPA","9.12 CGPA",
              "82%","8.00 CGPA","7.21 CGPA","8.27 CGPA"]
}

df = pd.DataFrame(data)

display(HTML("<h1>Student Table</h1>"))
display(df)

   Roll No            Name     Class         DOB Gender       City      Marks
0        1    Nisha Thakur  Bachelor  2005-01-26      F         UP  8.27 CGPA
1        2   Shivam Thalur  Bachelor  2005-06-30      M  Kathmandu  9.27 CGPA
2        3          Muskan  Bachelor  2006-12-17      F         UP  8.27 CGPA
3        4         Sandhya  Bachelor  2005-09-01      F    Haryana  9.12 CGPA
4        5  Aaditya Thakur       Ten  2008-08-18      M   Janakpur        82%
5        6   Amisha Thakur  Bachelor  2003-03-14      F   Janakpur  8.00 CGPA
6        7          Shisha  Bachelor  2004-02-16      F      Delhi  7.21 CGPA
7        8            Aasu       XII  2004-04-16      F         UP  8.27 CGPA

In [23]:
print(df.columns) # colums are displayed in horizontal rows.

Index(['Roll No', 'Name', 'Class', 'DOB', 'Gender', 'City', 'Marks'], dtype='object')

In [25]:
print(df.head()) # by default, df.head() first 5 rows name display karta hai.

   Roll No            Name     Class         DOB Gender       City      Marks
0        1    Nisha Thakur  Bachelor  2005-01-26      F         UP  8.27 CGPA
1        2   Shivam Thalur  Bachelor  2005-06-30      M  Kathmandu  9.27 CGPA
2        3          Muskan  Bachelor  2006-12-17      F         UP  8.27 CGPA
3        4         Sandhya  Bachelor  2005-09-01      F    Haryana  9.12 CGPA
4        5  Aaditya Thakur       Ten  2008-08-18      M   Janakpur        82%
The history saving thread hit an unexpected error (OperationalError('attempt to write a readonly database')).History will not be written to the database.

In [26]:
print(df.shape) # it's return 2 value that is 
                # rows:- total number of recorda(entries)
                #columns:- total number of variables/features

(8, 7)

# NOTE 
     :- Table is the combination of Rows and Columns.
     1.
         :- for example:-
         
            Nisha Thakur	Bachelor	2005-01-26	F	UP	 8.27CGPA

           i. One row :- One row represents the details of one student.

#IMPORTANT :-

             (In hindi)

             Columns se hume table ka structure pata chalta hai.
Database ki language me is structure ko Schema kaha jata hai.

ðŸ‘‰ Schema ka matlab hota hai database ke andar table ka design.
Jab hum kisi table ke columns dekhte hain, to hume yeh samajh aata hai ki us table ke andar kaun-kaun sa data store hota hai aur kis type ka data store hota hai.

Example:
Agar hum Student table ke columns dekhen, jaise:

Student_Name

Roll_No

Class

DOB

Gender

City

Marks

Toh hume clearly pata chal jata hai ki yeh table student-related data store karne ke liye bana hai.

Rows ka matlab hota hai individual records.
ðŸ‘‰ Each row represents one studentâ€™s complete data.

Example:
Roll_No = 1 wali row me:

Student_Name = Nisha Thakur

Class = 10

City = Delhi

Marks = 85

Iska matlab yeh hua ki rows hume ek-ek student ka actual data batati hain, jabki columns yeh define karte hain ki data ka structure kya hoga.
    
    
        (In english)

Columns help us understand the structure of a table.
In database terminology, this structure is called the schema.

Schema means the design of a table inside a database.
By looking at the columns, we can understand:

What type of data is stored

What information the table contains

       Example:
       If we look at the columns of a Student table, such as:

       Student_Name
       Roll_No
       Class
       Date_of_Birth
       Gender
       City
       Marks

We can clearly understand that this table is designed to store student-related information.

      #Rows represent individual records

 Each row contains the complete data of one student.

      Example:
      For Roll_No = 1, the row may contain:

      Student_Name = Nisha Thakur
      Class = 10
      City = Delhi
      Marks = 85

This means that rows store the actual data, while columns define the structure (schema) of the table.

# SQL Datatype

They define the type of values that can be stored in an column.

In [28]:
import pandas as pd 
Data = {"DATATYPE":["CHAR", "VARCHAR", "BLOB", "INT", "TINYINT", "BIGINT",
        "BIT", "FLOAT", "DOUBLE", "BOOLEAN", "DATE", "YEAR"
    ],"DESCRIPTION": [
        "string (0â€“255), fixed-length characters",
        "string (0â€“255), variable-length characters",
        "binary large object (0â€“65535)",
        "integer (-2,147,483,648 to 2,147,483,647)",
        "integer (-128 to 127)",
        "integer (-9,223,372,036,854,775,808 to 9,223,372,036,854,775,807)",
        "stores x-bit values (1 to 64)",
        "decimal number with precision up to 23 digits",
        "decimal number with precision 24 to 53 digits",
        "boolean values 0 or 1",
        "date format YYYY-MM-DD (1000-01-01 to 9999-12-31)",
        "year in 4-digit format (1901 to 2155)"],
         "USAGE": [
        "CHAR(50)", "VARCHAR(50)", "BLOB(1000)", "INT", "TINYINT",
        "BIGINT", "BIT(2)", "FLOAT", "DOUBLE", "BOOLEAN", "DATE", "YEAR"
    ]}
#create datafram
dff= pd.DataFrame(Data)

#display dataframe
dff

   DATATYPE                                        DESCRIPTION        USAGE
0      CHAR            string (0â€“255), fixed-length characters     CHAR(50)
1   VARCHAR         string (0â€“255), variable-length characters  VARCHAR(50)
2      BLOB                      binary large object (0â€“65535)   BLOB(1000)
3       INT          integer (-2,147,483,648 to 2,147,483,647)          INT
4   TINYINT                              integer (-128 to 127)      TINYINT
5    BIGINT  integer (-9,223,372,036,854,775,808 to 9,223,3...       BIGINT
6       BIT                      stores x-bit values (1 to 64)       BIT(2)
7     FLOAT      decimal number with precision up to 23 digits        FLOAT
8    DOUBLE      decimal number with precision 24 to 53 digits       DOUBLE
9   BOOLEAN                              boolean values 0 or 1      BOOLEAN
10     DATE  date format YYYY-MM-DD (1000-01-01 to 9999-12-31)         DATE
11     YEAR              year in 4-digit format (1901 to 2155)         YEAR

In [29]:
from IPython.display import HTML, display

display(HTML('<a href="https://www.w3schools.com/sql/sql_datatypes.asp">SQL Datatypes Reference</a>'))

#Note :- SQL has many data types, and itâ€™s not possible to remember all of them. So I mention the reference link, which makes it easier for me to revise and remember later. this is the link (https://www.w3schools.com/sql/sql_datatypes.asp)

# Explain the basic SQL datatypes in detail:-

# CHAR, VARCHAR, and BLOB

1. CHAR vs VARCHAR

       (In hindi)

1.CHAR(n):

CHAR fixed length hota hai. Matlab agar aap CHAR(50) declare karte ho, toh 50 characters ka memory hamesha reserve ho jaata hai, chahe aap usme sirf 5 characters store karo ya 50.

Example: DELHI store kar rahe ho â†’ memory me 5 characters store honge + baki 45 spaces bhi reserve rahenge.

Use case: Jab aapko pata ho ki string ki length mostly same rahegi, jaise Gender (M/F), Status (Y/N) etc.

2.VARCHAR(n):

VARCHAR variable length hota hai. Matlab agar aap VARCHAR(50) declare karte ho, toh sirf jitni actual characters store kar rahe ho, utni hi memory use hoti hai.

Example: DELHI store kar rahe ho â†’ sirf 5 characters ke liye memory use hogi, baki 45 waste nahi honge.

Use case: Jab strings ki length alag-alag ho sakti hai, jaise City Name, Address, etc.


       (In english)

    CHAR vs VARCHAR:

Both CHAR and VARCHAR store string data, but the difference is in how memory is reserved.

1.CHAR(n):

Always reserves n spaces in memory, whether you use them or not.

Example: CHAR(50) will always reserve 50 spaces.

Suppose you store 'DELHI' (5 letters), it will use index 0-4 for the text, but the remaining 45 spaces will still be reserved and stay wasted.

2.VARCHAR(n):

Only uses the memory required to store the actual string.

Example: VARCHAR(50) storing 'DELHI' will only use 5 spaces, not 50.

This means no memory is wasted for unused space.


        #Simple difference:

        i.CHAR â†’ Fixed memory, waste ho sakta hai.
        ii.VARCHAR â†’ Flexible memory, efficient.

3..BLOB (Binary Large Object)

BLOB ka use bhi data store karne ke liye hota hai, lekin ye normal string (text) ke liye nahi hota.

BLOB mainly large size data store karne ke liye use hota hai, jo text ke alawa bhi ho sakta hai.

         Example:

       i.CSV files
       ii.Images
      iii.Videos
      iv.Audio files
      v.PDFs
      vi.Binary data

Jab data bahut bada ho aur uska fixed ya variable character length se kaam na chale, tab hum BLOB use karte hain.

# 2.Integer Data Types (SQL)


          (In hindi)

1.INT

.INT ka use integer (whole number) values store karne ke liye hota hai.

Iska range hota hai:
â€“2,147,483,648 to 2,147,483,647

Example: student_id, age, marks, etc.

2.TINYINT

TINYINT, INT ka chhota version hota hai.

Iska range hota hai:
â€“128 to 127

Jab hume bahut chhoti numeric value store karni ho, tab TINYINT use karte hain.

3.MEDIUMINT

Ye INT aur BIGINT ke beech ka data type hota hai.

Iska range INT se bada aur BIGINT se chhota hota hai.

Medium size integer values ke liye use hota hai.

4.BIGINT

BIGINT ka use bahut large integer values store karne ke liye hota hai.

Iska range hota hai:
â€“9,223,372,036,854,775,808
to
9,223,372,036,854,775,807

Example: large IDs, bank transaction numbers, etc.

5.BIT Data Type

BIT data type ka use binary values (0 aur 1) store karne ke liye hota hai.

Isme hum khud decide kar sakte hain ki kitne bits store karne hain.

Example:

BIT(1) â†’ sirf 1 bit store hogi â†’ values: 0 ya 1

BIT(2) â†’ 2 bits store hongi â†’ possible values:
00, 01, 10, 11

Yahan:

0 ka matlab false / no / off

1 ka matlab true / yes / on

        #Simple words me:#

       i. INT family â†’ numbers ke size ke according choose karte hain
       ii.BIT â†’ binary form me data store karta hai (flags, yes/no, on/off)




           (In english)



1.INT

INT is used to store integer (whole number) values.

Its range is:
â€“2,147,483,648 to 2,147,483,647

Commonly used for values like IDs, age, marks, etc.

2.TINYINT

TINYINT is a smaller version of INT.

Its range is:
â€“128 to 127

It is used when only very small numeric values are required.

3.MEDIUMINT

MEDIUMINT is larger than INT but smaller than BIGINT.

It is used for medium-sized integer values.

4.BIGINT

BIGINT is used to store very large integer values.

Its range is:
â€“9,223,372,036,854,775,808
to
9,223,372,036,854,775,807

It is commonly used for large IDs or transaction numbers.

5.BIT Data Type

BIT data type is used to store binary values (0 and 1).

You can define how many bits you want to store.

Examples:

BIT(1) â†’ can store only one bit â†’ values: 0 or 1

BIT(2) â†’ can store two bits â†’ possible values:
00, 01, 10, 11

Meaning of values:

0 â†’ false / no / off

1 â†’ true / yes / on

         #simple words#
       i.  INT, TINYINT, MEDIUMINT, BIGINT â†’ used to store numbers of different sizes.
       ii. BIT â†’ used to store binary or boolean-type values.

# SQL Datatypes

:- there are also another two  SQL datatype that is :

    1.Signed 
    2.Unsigned

    :- SQL query(command of SQL)

    TINYINT UNSIGNED (0 to 255)

    TINYINT(-128 to 127)
#Note:- TINYINT normally stores values in the range
â€“128 to 127, so it cannot store values like 128 or 129.

However, when we use UNSIGNED with TINYINT, it stores only positive values, and the range changes to:
0 to 255.

Because of this extended positive range, values like 128 and 129 can be stored when TINYINT is declared as UNSIGNED.

# Types of SQL Commands 
:- Their are 5 types of SQL commands 

      1.DDL(Data Definition Language)     : create, alter, remane, truncate and drp
      2.DQL(Data Query Language)          :select
      3.DML(Data Manipulation Language)   : insert,update and delete
      4.DCL(Data Control Language)        : grant and revoke permission to users
      5.TCL(Transaction Control Language) :start transcation, commit, rollback